commands_templates/CreateRSAKeyPair0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/advancedsecurity/wsdl">
   <soap:Header/>
   <soap:Body>
      <wsdl:CreateRSAKeyPair>
         <!--type: nonNegativeInteger-->
         <wsdl:KeyLength>?</wsdl:KeyLength>
         <!--Optional:-->
         <!--type: string-->
         <wsdl:Alias>?</wsdl:Alias>
      </wsdl:CreateRSAKeyPair>
   </soap:Body>
</soap:Envelope>